In [10]:
hello = "السلام عليكم"
print(hello)

السلام عليكم

In [11]:
import pandas as STUDY

# META_DATA

SCHOOL: Military_Institute_of_Translation_(MIT) 
ACADEMIC_DEPARTMENT: third_secondary
SECTION: A_1
STUDANTS: 10
SUBJECT: Translation
NOTE: min=0, max=20

# Student_note

In [12]:
note = [10, 13, 7, 15, 3, 18, 19, 13, 12, 12]
student_sex = ["M", "F", "M", "F", "M", "F", "F", "F", "M", "M"]
student_age = [20, 18, 19, 18, 20, 18, 18, 18, 20, 21]
replay = [2, 0, 1, 0, 2, 0, 1, 0, 2, 3]

In [13]:
S_T = STUDY.DataFrame({
    "NOTE": note,
    "SEX": student_sex,
    "AGE": student_age,
    "REPLAY": replay})
S_T

   NOTE SEX  AGE  REPLAY
0    10   M   20       2
1    13   F   18       0
2     7   M   19       1
3    15   F   18       0
4     3   M   20       2
5    18   F   18       0
6    19   F   18       1
7    13   F   18       0
8    12   M   20       2
9    12   M   21       3

# THE_HIGHEST_NOTE

In [14]:
N_MAX = S_T [S_T["NOTE"] == S_T["NOTE"].max()]
N_MAX

   NOTE SEX  AGE  REPLAY
6    19   F   18       1

# THE_LOWEST_NOTE

In [15]:
N_MIN = S_T [S_T["NOTE"] == S_T["NOTE"].min()]
N_MIN

   NOTE SEX  AGE  REPLAY
4     3   M   20       2

# MALE_INFORMATION

In [16]:
S_M_I = S_T[S_T["SEX"] == "M"]
S_M_I

   NOTE SEX  AGE  REPLAY
0    10   M   20       2
2     7   M   19       1
4     3   M   20       2
8    12   M   20       2
9    12   M   21       3

# THE_HIGHEST_MALE_NOTE

In [17]:
MAX_S_M_N = S_M_I[S_M_I["NOTE"] == S_M_I["NOTE"].max()]
MAX_S_M_N

   NOTE SEX  AGE  REPLAY
8    12   M   20       2
9    12   M   21       3

# THE_LOWEST_MALE_NOTE

In [18]:
MIN_S_M_N = S_M_I[S_M_I["NOTE"] == S_M_I["NOTE"].min()]
MIN_S_M_N

   NOTE SEX  AGE  REPLAY
4     3   M   20       2

# FEMALE_INFORMATION

In [19]:
S_F_I = S_T[S_T["SEX"] == "F"]
S_F_I

   NOTE SEX  AGE  REPLAY
1    13   F   18       0
3    15   F   18       0
5    18   F   18       0
6    19   F   18       1
7    13   F   18       0

# THE_HIGHEST_FEMALE_NOTE

In [21]:
MAX_S_F_N = S_F_I[S_F_I["NOTE"] == S_F_I["NOTE"].max()]
MAX_S_F_N

   NOTE SEX  AGE  REPLAY
6    19   F   18       1

# THE_LOWEST_FEMALE_NOTE

In [22]:
MIN_S_F_N = S_F_I[S_F_I["NOTE"] == S_F_I["NOTE"].min()]
MIN_S_F_N

   NOTE SEX  AGE  REPLAY
1    13   F   18       0
7    13   F   18       0

# INFORMATION_AGE(18)

In [23]:
I_A_18 = S_T[S_T["AGE"] == 18]
I_A_18

   NOTE SEX  AGE  REPLAY
1    13   F   18       0
3    15   F   18       0
5    18   F   18       0
6    19   F   18       1
7    13   F   18       0

# INFORMATION_AGE(19)

In [24]:
I_A_19 = S_T[S_T["AGE"] == 19]
I_A_19

   NOTE SEX  AGE  REPLAY
2     7   M   19       1

# INFORMATION_AGE(20)

In [25]:
I_A_20 = S_T[S_T["AGE"] == 20]
I_A_20

   NOTE SEX  AGE  REPLAY
0    10   M   20       2
4     3   M   20       2
8    12   M   20       2

# INFORMATION_AGE(21)

In [26]:
I_A_21 = S_T[S_T["AGE"] == 21]
I_A_21

   NOTE SEX  AGE  REPLAY
9    12   M   21       3

# INFORMATION_REPLAY(0)

In [27]:
I_R_0 = S_T[S_T["REPLAY"] == 0]
I_R_0

   NOTE SEX  AGE  REPLAY
1    13   F   18       0
3    15   F   18       0
5    18   F   18       0
7    13   F   18       0

# INFORMATION_REPLAY(1)

In [28]:
I_R_1 = S_T[S_T["REPLAY"] == 1]
I_R_1

   NOTE SEX  AGE  REPLAY
2     7   M   19       1
6    19   F   18       1

# INFORMATION_REPLAY(2)

In [29]:
I_R_2 = S_T[S_T["REPLAY"] == 2]
I_R_2

   NOTE SEX  AGE  REPLAY
0    10   M   20       2
4     3   M   20       2
8    12   M   20       2

# INFORMATION_REPLAY(3)

In [30]:
I_R_3 = S_T[S_T["REPLAY"] == 3]
I_R_3

   NOTE SEX  AGE  REPLAY
9    12   M   21       3

# A_REPORT

Teaching assistants more than once have a poor academic level
Females are generally better than males in the study
Better notes you get younger in comparison to their buddies

# ROUINA ABDELKARIM